Revit 2026 API

# AreaBasedLoadBoundaryLineDataTopLevelId Property

---

The top level id of the area based load boundary line.

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public ElementId TopLevelId { get; set; }
```
```vb
Public Property TopLevelId As ElementId
	Get
	Set
```
```cpp
public:
property ElementId^ TopLevelId {
	ElementId^ get ();
	void set (ElementId^ value);
}
```
```fsharp
member TopLevelId : ElementId with get, set
```

#### Property Value

ElementId

| Exception | Condition |
| --- | --- |
| ArgumentException | When setting this property: The ElementId levelId cannot be used as the top level. The ElementId levelId is not a Level or it's elevation is lower than the bottom level's elevation. |
| ArgumentNullException | When setting this property: A non-optional argument was null |

The top level's elevation cannot be lower than the bottom level.

#### Reference

AreaBasedLoadBoundaryLineData Class

Autodesk.Revit.DB.Electrical Namespace